Test Data/Azure/web-perf-pub1.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 138.91.121.164 (be patient)


Server Software:        Apache/2.4.29
Server Hostname:        138.91.121.164
Server Port:            80

Document Path:          /helloworld.html
Document Length:        115 bytes

Concurrency Level:      100
Time taken for tests:   5.781 seconds
Complete requests:      10000
Failed requests:        25
   (Connect: 0, Receive: 0, Length: 25, Exceptions: 0)
Keep-Alive requests:    9890
Total transferred:      4196187 bytes
HTML transferred:       1147240 bytes
Requests per second:    1729.80 [#/sec] (mean)
Time per request:       57.810 [ms] (mean)
Time per request:       0.578 [ms] (mean, across all concurrent requests)
Transfer rate:          708.84 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.9      0      12
Processing:     0   37 385.4      2    5372
Waiting:        0   25 294.7      2    5372
Total:          0   37 385.5      2    5374

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      2
  90%      3
  95%      4
  98%      8
  99%    586
 100%   5374 (longest request)