Test Data/Azure/web-perf-pub2.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 138.91.121.164 (be patient)


Server Software:        Apache/2.4.29
Server Hostname:        138.91.121.164
Server Port:            80

Document Path:          /helloworld.html
Document Length:        115 bytes

Concurrency Level:      100
Time taken for tests:   5.676 seconds
Complete requests:      10000
Failed requests:        0
Keep-Alive requests:    9948
Total transferred:      4207719 bytes
HTML transferred:       1150000 bytes
Requests per second:    1761.91 [#/sec] (mean)
Time per request:       56.757 [ms] (mean)
Time per request:       0.568 [ms] (mean, across all concurrent requests)
Transfer rate:          723.99 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0       9
Processing:     0   25 294.2      3    5262
Waiting:        0   25 294.2      3    5262
Total:          0   25 294.3      3    5263

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      4
  75%      4
  80%      4
  90%      5
  95%      6
  98%     12
  99%     68
 100%   5263 (longest request)