Test Data/Azure/web-perf-pub3.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 138.91.121.164 (be patient)


Server Software:        Apache/2.4.29
Server Hostname:        138.91.121.164
Server Port:            80

Document Path:          /helloworld.html
Document Length:        115 bytes

Concurrency Level:      100
Time taken for tests:   6.591 seconds
Complete requests:      10000
Failed requests:        13
   (Connect: 0, Receive: 0, Length: 13, Exceptions: 0)
Keep-Alive requests:    9894
Total transferred:      4200522 bytes
HTML transferred:       1148505 bytes
Requests per second:    1517.23 [#/sec] (mean)
Time per request:       65.909 [ms] (mean)
Time per request:       0.659 [ms] (mean, across all concurrent requests)
Transfer rate:          622.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0       9
Processing:     0   46 442.9      1    5870
Waiting:        0   40 405.6      1    5870
Total:          0   46 443.1      1    5871

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      2
  98%      9
  99%    728
 100%   5871 (longest request)